---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralMaterialType
source: html/133caafb-a1f6-699a-fde1-f5fb79e64560.htm
---
# Autodesk.Revit.DB.Structure.StructuralMaterialType

Represents the structural material type. This enum value is returned by Autodesk::Revit::DB::FamilyInstance::StructuralMaterialType.

## Syntax (C#)
```csharp
public enum StructuralMaterialType
```